Ran Plan for project: `terraform-github` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.repositories.module.terraform-gcloud.data.sops_file.secrets: Reading...
module.repositories.module.terraform-minio.data.sops_file.secrets: Reading...
module.repositories.module.terraform-vault.data.sops_file.secrets: Reading...
module.organization.data.sops_file.secrets: Reading...
module.repositories.module.terraform-gworkspace.data.sops_file.secrets: Reading...
module.repositories.module.terraform-github.data.sops_file.secrets: Reading...
module.repositories.module.terraform-discord.data.sops_file.secrets: Reading...
module.repositories.module.terraform-vault.data.sops_file.secrets: Read complete after 0s [id=-]
module.repositories.module.terraform-gcloud.data.sops_file.secrets: Read complete after 0s [id=-]
module.repositories.module.terraform-minio.data.sops_file.secrets: Read complete after 0s [id=-]
module.organization.data.sops_file.secrets: Read complete after 0s [id=-]
module.repositories.module.terraform-github.data.sops_file.secrets: Read complete after 0s [id=-]
module.repositories.module.terraform-discord.data.sops_file.secrets: Read complete after 0s [id=-]
module.repositories.module.terraform-gworkspace.data.sops_file.secrets: Read complete after 0s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.organization.github_membership.admins["jazzlyn"] will be created
+ resource "github_membership" "admins" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "admin"
+       username             = "jazzlyn"
    }

  # module.organization.github_membership.admins["techtales-automation"] will be created
+ resource "github_membership" "admins" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "admin"
+       username             = "techtales-automation"
    }

  # module.organization.github_membership.admins["tyriis"] will be created
+ resource "github_membership" "admins" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "admin"
+       username             = "tyriis"
    }

  # module.organization.github_organization_settings.techtales_io will be created
+ resource "github_organization_settings" "techtales_io" {
+       advanced_security_enabled_for_new_repositories               = false
+       billing_email                                                = (sensitive value)
+       blog                                                         = "https://techtales.io"
+       company                                                      = "techtales.io"
+       default_repository_permission                                = "read"
+       dependabot_alerts_enabled_for_new_repositories               = false
+       dependabot_security_updates_enabled_for_new_repositories     = false
+       dependency_graph_enabled_for_new_repositories                = false
+       has_organization_projects                                    = true
+       has_repository_projects                                      = true
+       id                                                           = (known after apply)
+       location                                                     = "Austria"
+       members_can_create_internal_repositories                     = false
+       members_can_create_pages                                     = true
+       members_can_create_private_pages                             = false
+       members_can_create_private_repositories                      = false
+       members_can_create_public_pages                              = true
+       members_can_create_public_repositories                       = false
+       members_can_create_repositories                              = false
+       members_can_fork_private_repositories                        = false
+       name                                                         = "techtales.io"
+       secret_scanning_enabled_for_new_repositories                 = false
+       secret_scanning_push_protection_enabled_for_new_repositories = false
+       web_commit_signoff_required                                  = false
    }

  # module.organization.github_organization_webhook.arc will be created
+ resource "github_organization_webhook" "arc" {
+       active = true
+       etag   = (known after apply)
+       events = [
+           "workflow_job",
+           "workflow_run",
        ]
+       id     = (known after apply)
+       url    = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.backstage-docs.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "backstage-docs"
    }

  # module.repositories.module.backstage-docs.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "backstage-docs"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.backstage-docs.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "backstage documentation"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "backstage-docs"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "backstage",
+           "documentation",
+           "techtales",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.containers.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "containers"
    }

  # module.repositories.module.containers.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "containers"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.containers.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "Docker containers for various tools and applications"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "containers"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "containers",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.github-workflows.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "github-workflows"
    }

  # module.repositories.module.github-workflows.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "github-workflows"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.github-workflows.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "reusable github workflows"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "github-workflows"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "ci",
+           "github-actions",
+           "github-workflows",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.mkdocs-blog.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "mkdocs-blog"
    }

  # module.repositories.module.mkdocs-blog.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "source repo for website"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "mkdocs-blog"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "techtales",
+           "website",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.renovate-config.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "renovate-config"
    }

  # module.repositories.module.renovate-config.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "renovate-config"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.renovate-config.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "central renovate configuration"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "renovate-config"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "renovate",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.techtales-io-github-io.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "techtales-io.github.io"
    }

  # module.repositories.module.techtales-io-github-io.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "techtales-io.github.io"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.techtales-io-github-io.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "github pages for techtales.io"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "techtales-io.github.io"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "techtales",
+           "website",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       pages {
+           build_type = "workflow"
+           custom_404 = (known after apply)
+           html_url   = (known after apply)
+           status     = (known after apply)
+           url        = (known after apply)

+           source {
+               branch = "main"
+               path   = "/"
            }
        }

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-discord.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-discord"
    }

  # module.repositories.module.terraform-discord.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-discord"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform-discord.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for the techtales discord server with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-discord"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "discord",
+           "gitops",
+           "iac",
+           "terraform",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-discord.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-discord"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.terraform-gcloud.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-gcloud"
    }

  # module.repositories.module.terraform-gcloud.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for Google Cloud resources with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-gcloud"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "google-cloud",
+           "terraform",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis {
        }
    }

  # module.repositories.module.terraform-gcloud.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-gcloud"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.terraform-github.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-github"
    }

  # module.repositories.module.terraform-github.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-github"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform-github.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for Github resources with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-github"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "terraform",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-github.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-github"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.terraform-gworkspace.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-gworkspace"
    }

  # module.repositories.module.terraform-gworkspace.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for Google Workspace resources with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-gworkspace"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "terraform",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-gworkspace.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-gworkspace"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.terraform-minio.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-minio"
    }

  # module.repositories.module.terraform-minio.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-minio"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform-minio.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for the MinIO S3 server with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       homepage_url                = "https://minio.techtales.io"
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-minio"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "gitops",
+           "iac",
+           "infrastructure-as-code",
+           "minio",
+           "s3",
+           "terraform",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-minio.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-minio"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.terraform-unifi.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-unifi"
    }

  # module.repositories.module.terraform-unifi.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-unifi"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform-unifi.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for unifi resources with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-unifi"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "terraform",
+           "unifi",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-vault.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "terraform-vault"
    }

  # module.repositories.module.terraform-vault.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "IaC for Hashicorp Vault resources with Terraform"
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "terraform-vault"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "terraform",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # module.repositories.module.terraform-vault.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-vault"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

  # module.repositories.module.website.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "website"
    }

  # module.repositories.module.website.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "website"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.website.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       etag                        = (known after apply)
+       fork                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "website"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       source_owner                = (known after apply)
+       source_repo                 = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "techtales",
+           "website",
        ]
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
        # (2 unchanged attributes hidden)

+       pages {
+           build_type = "legacy"
+           custom_404 = (known after apply)
+           html_url   = (known after apply)
+           status     = (known after apply)
+           url        = (known after apply)

+           source {
+               branch = "gh-pages"
+               path   = "/"
            }
        }

+       security_and_analysis (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p terraform-github
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-github.techtales.io/lock?id=techtales-io%252Fterraform-github%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p terraform-github
  ```
Plan: 49 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```